[
    {
        "sign": "Virgo",
        "horoscope": "Contemplating on past successes will help you gather the resources for achieving more of it in the near future. New contacts will help you make considerable headway on the road to success. Ganesha says your amiable nature will help you in getting along easily with people."
    },
    {
        "sign": "Libra",
        "horoscope": "Ganeshji says that today you shall make your competitors and enemies envious of your success in business. Beware, as they shall try to hurt or put down your reputation in varied ways. Instead of having a fight with them you should try to be politically correct and take care of matters using your intelligence. This afternoon can bring in a new love in your life that will be very good for you."
    },
    {
        "sign": "Scorpio",
        "horoscope": "Long pending task of getting your home renovated may begin today. There are a couple of object de art that have caught your eyes and you wish to decorate your home with those artefacts. You may even plan a small celebration to share your home's new look! A great day indeed."
    },
    {
        "sign": "Sagittarius",
        "horoscope": "Your ways to deal with your team mates and colleagues will be strict and disciplined. However, your perfect ways at work will leave them awestruck. Your personal equations will be least affected by your stern ways, says Ganesha. Do not let success go to your head."
    },
    {
        "sign": "Capricorn",
        "horoscope": "You are not an impulsive person and this reflects in whatever you do. Money will be on your mind almost through out the day. Generally, you are a penny pincher, but during the later half of the day you will go on a spending spree. Don't ignore your pocket while spending, otherwise you may end up burning a hole in it, advises Ganesha."
    },
    {
        "sign": "Aquarius",
        "horoscope": "Today is your day! Your performance will speak for itself and everyone at work, including bosses, will appreciate your efforts, says Ganesha. Work will not seem burdensome any more, in fact you will enjoy your job like never before. You may wish to contact some old friends and be in touch with them once again."
    },
    {
        "sign": "Pisces",
        "horoscope": "Controversy and differences circle overhead, almost waiting for a chance to corner you. Even though you are a happy go lucky person, you may feel a little run down and disgruntled today. But don't lost heart, says Ganesha, because as the day progresses you will find bigger and better reasons to smile. Your spouse or loved one will have a major role to play in restoring your happiness."
    },
    {
        "sign": "Aries",
        "horoscope": "Today you will feel like displaying your power. If you find that people are awe-struck when you pass by, take it that your labours are doing the trick. Otherwise, take it that you have to get things in better order. Ganesha says either ways you have more work to do."
    },
    {
        "sign": "Taurus",
        "horoscope": "This may be, health wise, a bad day for you. Ganesha urges you to take special care and not to do anything that invites illness or discomfort. The least you can do is to ensure that you do not over exert or get into situations that generate tension and anxiety. Be careful about the food you eat. Make sure that the water you drink is potable and safe. Do not expose yourself to extreme heat or cold. Act sensibly."
    },
    {
        "sign": "Gemini",
        "horoscope": "An auspicious and progressive day awaits you. Alongwith your daily work you will also be able to tackle your personal issues as well. You will establish an emotional bonding with some person, or will feel the need to. It is a good day to ponder over issues such as partnership or marriage. It is a profitable day to sell anything, says Ganesha."
    },
    {
        "sign": "Cancer",
        "horoscope": "An awareness of optimism and idealism will mark your activities this day. You may benefit by traversing from one terrain to another. You will be liberal and generous with ideas; your internal beauty will blossom."
    },
    {
        "sign": "Leo",
        "horoscope": "You will have to bear more responsibilities in the office. You need to carefully weigh your alternatives before making a decision. On the personal front, you will need to watch against minor conflicts with your partner cropping up. You will be able to take part in entertaining and fun activities, says Ganesha."
    }
]